import React from 'react';
import styles from './.module.scss';
import CertificationBox from './_components/CertificationBox';
import CertificationOne from '../../assets/certification1.jpg';
import Certification2 from '../../assets/certification2.jpg';
import Certification3 from '../../assets/certificatio3.jpg';
import Certification4 from '../../assets/certificatio4.jpg';
import Certification5 from '../../assets/certificatio5.jpg';
import Certification6 from '../../assets/certificatio6.jpg';


const certifications = [
  {
    image: CertificationOne,
    title: "عرض القران الكريم على عدد من مقرئي المسجد الحرم برواية حفص عن عاصم",
    subtitle: 'يُسعد الإدارة العامة للحلقات والمقرأة الإلكترونية ممثلة بإدارة الحلقات القرآنية بالمسجد الحرام أن تهنئ الحافظ علاء رجب عبد المقصود "مصرى الجنسية" لتشرفه بعرض القرآن الكريم على عدد من مقرئي المسجد الحرام برواية حفص عن عاصم وذلك خلال الفترة من ١٤٤٥/٥/٢٢ هـ إلى ١٤٤٥/٥/٢٦ هـ والإدارة إذ تمنحه هذه الشهادة، وتوصيه بتقوى الله والمحافظة على تعاهد كتابه والعمل به',
    date: "١٤٤٥/٥/٢٦ هـ"
  },
  {
    image: Certification2,
    title: "إجازة فى متن السلسبيل الشافى",
    subtitle: 'العبد الراجي عفو ربه الشيخ / أحمد بن عبد القادر بن على حسانين إنه قد جاء إلى الطالب / علاء رجب عبد المقصود وقرأ على متن السلسبيل الشافي للشيخ العلامة عثمان سليمان مراد" رحمه الله" قراءة صحيحة في مجلس واحد من حفظه وبما يوافق ما تلقيته على مشايخي ، وسمع مني طرفا من شرحه ، وقد استجازني بما قرأ به عليّ فاجزته إجازة صحيحة بهذا المتن  والله على ما أقول وكيل',
    date: ""
  },
  {
    image: Certification3,
    title: "إجازة القراءة والإقراء برواية حفص عن عاصم من طريق الشاطبية",
    subtitle: "العبد الفقير الراجي عفو ربه القدير الشيخ / أحمد بن عبد القادر إنه قد جائني الشيخ الفاضل اعلاء رجب عبد المقصود وقراء على القرآن العظيم الشان حرفا حرفا من أوله إلى آخره غيبا من حفظه وضبط صدرة برواية حفص عن عاصم من طريق الشاطبية وطلب مني أن أجيزه ، فأجزته بالقراءة والإقراء في أي مكان حل، وفي أي قطر نزل ، بشرطهما المعتبر عند علماء الأثر ، لا ينازعه في ذلك أحد",
    date: "١٤٣٤/٤/٥ هـ"
  },
  {
    image: Certification4,
    title: "إجازة القراءة والإقراء برواية حفص عن عاصم من طريق الشاطبية",
    subtitle: "يقول راجي عفو ربه فضيلة الشيخ / عبد الفتاح بن محمد بن شحات سلومة المقرئ بقرية ترسا محافظة الجيزة . إنه قد جاءني ابني الفاضل اعلاء رجب وقرأ عليّ القرآن الكريم من أوله إلى آخره غيباً من حفظه وضبط صدره برواية حفص عن عاصم من طريق الشاطبية ، ثم استجازني ، فأجزته إجازة صحيحة بشرطها المعتبر عند أهل الأثرو , ولما تبين لي من حال الشيخ المذكور أنه بلغ معرفة رواية حفص عن عاصم وأتقنها اجزته بان يقرا ويقرئ من شاء متى شاء في أي قطر نزل حل أو ارتحل إجازة صحيحة.",
    date: "١٤٣٣/٥/٤ هـ"
  },
  {
    image: Certification5,
    title: "إجازة القراءة والإقراء برواية حفص عن عاصم بقصر وتوسط المد المنفصل من طريق الشاطبية",
    subtitle: "يقول راجي عفو ربه الشيخ / عبد الفتاح بن مدكورين محمد بن بيومي المولود بقرية أبو النمرس بالجيزة , أنه قد جاءني ابني الفاضل الشيخ علاء رجب عبد المقصود المولود بمحافظة الجيزة بتاريخ ١٢ / ١٩٨٦/  على القرآن برواية حفص عن عاصم بقصر وتوسط المد المنفصل من طريق الشاطبية والطيبة وسمع مني بعضه وتلقى على طرفاً من مباحث علم التجويد بالتكرير والتسديد ثم استجازني فأجزته إجازة صحيحة بشرطها المعتبر عند أهل الأثر",
    date: "١٤٣٦/٤/٥ هـ"
  },
  {
    image: Certification6,
    title: "المركز الاول فى مسابقة القرآن الكريم",
    subtitle: "الازهر الشريف بمعهد قراءات خاتم المرسلين تقرر منح الطالب / علاء رجب عبدالمقصود شهادة تقدير بمناسبة المركز الاول فى مسابقة القرآن الكريم",
    date: "١٤٣٨/٣/٢٥ هـ"
  },
]

const Certifications = () => {
  return (
    <section id="certifications-section" className={`section ${styles.section}`}>
      <h2 className={`section__title`}>إجازاتي</h2>
      {/* <p className={`section__subtitle`}>
        هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا
        النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من
        النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
      </p> */}
      <div className={styles.list}>
        {certifications?.map((certificate, i) => (
          <CertificationBox key={i} title={certificate?.title} subtitle={certificate?.subtitle} image={certificate?.image} date={certificate?.date} />
        ))}
        {/* <CertificationBox />
        <CertificationBox />
        <CertificationBox />
        <CertificationBox /> */}
      </div>
    </section>
  );
}

export default Certifications